Revit 2026 API

# UVDivide Method

---

Divides this 2-D vector by the specified value and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Divide(
	double value
)
```
```vb
Public Function Divide (
	value As Double
) As UV
```
```cpp
public:
UV^ Divide(
	double value
)
```
```fsharp
member Divide :
        value : float -> UV
```

#### Parameters

value Double
    The value to divide this vector by.

#### Return Value

UVThe divided 2-D vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |
| ArgumentException | Thrown when the specified value is zero. |

The divided vector is obtained by dividing each coordinate of this vector by the specified value.

#### Reference

UV Class

Autodesk.Revit.DB Namespace